%演示五个控制点的两段B样条曲线生成
%五个控制点C=[C1 C2 C3 C4 C5]
C=[0 1 2 3 4        %控制点Ｘ方向坐标
   0 1 0 1 0];      %控制点Ｙ方向坐标
%参数s为归一化位移0≤s≤1
s=0:0.01:1;
%
f1s=(1-s).^3/6;
f2s=(3*s.^3-6*s.^2+4)/6;
f3s=(-3*s.^3+3*s.^2+3*s+1)/6;
f4s=s.^3/6;
%
P1s=C(:,1)*f1s+C(:,2)*f2s+C(:,3)*f3s+C(:,4)*f4s;
P2s=C(:,2)*f1s+C(:,3)*f2s+C(:,4)*f3s+C(:,5)*f4s;
%绘制控制点及B样条曲线
figure(1)
plot(C(1,:),C(2,:),'r*',P1s(1,:),P1s(2,:),'b',P2s(1,:),P2s(2,:),'g');
legend('控制点','第一段','第二段')
title('五个控制点及其B样条曲线')
xlabel('x轴(米)')
ylabel('y轴(米)')
grid on
bold